In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', None, 'Grace', 'Henry', 'Ivy', 'Jack'],
    'Age': [25, 30, None, 22, 28, 35, 40, None, 27, 31],
    'Gender': ['F', 'M', 'M', None, 'F', 'F', 'F', 'M', None, 'M'],
    'City': ['New York', 'Los Angeles', None, 'Chicago', 'Houston', 'Phoenix', 'Philadelphia', 'San Antonio', 'San Diego', None],
    'Salary': [70000, None, 80000, 60000, 75000, 90000, None, 85000, 72000, 78000]
}

df = pd.DataFrame(data)
df

      Name   Age Gender          City   Salary
0    Alice  25.0      F      New York  70000.0
1      Bob  30.0      M   Los Angeles      NaN
2  Charlie   NaN      M          None  80000.0
3    David  22.0   None       Chicago  60000.0
4      Eva  28.0      F       Houston  75000.0
5     None  35.0      F       Phoenix  90000.0
6    Grace  40.0      F  Philadelphia      NaN
7    Henry   NaN      M   San Antonio  85000.0
8      Ivy  27.0   None     San Diego  72000.0
9     Jack  31.0      M          None  78000.0

In [7]:
df.isna()
df.isna().sum()
df.isna().sum().sum()
df.isna().any()

Name      True
Age       True
Gender    True
City      True
Salary    True
dtype: bool

In [ ]:
df.dropna()
df.dropna(thresh=3) # Keep rows with at least 3 non-NA values

      Name   Age Gender          City   Salary
0    Alice  25.0      F      New York  70000.0
1      Bob  30.0      M   Los Angeles      NaN
2  Charlie   NaN      M          None  80000.0
3    David  22.0   None       Chicago  60000.0
4      Eva  28.0      F       Houston  75000.0
5     None  35.0      F       Phoenix  90000.0
6    Grace  40.0      F  Philadelphia      NaN
7    Henry   NaN      M   San Antonio  85000.0
8      Ivy  27.0   None     San Diego  72000.0
9     Jack  31.0      M          None  78000.0